name: craftnet
backend: "onnxruntime"
max_batch_size: 0

input [
    {
        name: "input.1"
        data_type: TYPE_FLOAT32
        dims: [ -1, 3, 512, 512 ]
    }
]

output [
    {
        name: "285"
        data_type: TYPE_FLOAT32
        dims: [ -1, 256, 256, 2 ]
    },
    {
        name: "onnx:Conv_275"
        data_type: TYPE_FLOAT32
        dims: [ -1, 32, 256, 256 ]
    }
]