name: "detector"
backend: "python"
max_batch_size: 0

input [
  {
    name: "IMAGE"
    data_type: TYPE_INT64
    dims: [-1]
  }
]
output [
  {
    name: "PREDICTION"
    data_type: TYPE_FP32
    dims: [-1, 2, -1, -1]
  }
]